app/views/designs/index.html.erb

SELECT `designs`.* FROM `designs`
---

  <select id="category-filter" onchange="filterDesigns(this.value)">

SELECT `likes`.* FROM `likes` WHERE `likes`.`design_id` = 2
SELECT COUNT(*) FROM `likes` WHERE `likes`.`design_id` = 3
---
      <%= render design %>
      <% if design.likes && design.likes.present? %>
        <p><%= design.likes.count %> <%= (design.likes.count) == 1 ? 'Like' : 'Likes'%></p>

SELECT `ratings`.* FROM `ratings` WHERE `ratings`.`design_id` = 2
SELECT AVG(`ratings`.`value`) FROM `ratings` WHERE `ratings`.`design_id` = 2
---

      <% if design.ratings && design.ratings.present? %>
        <p>Average Rating: <%= design.ratings.average(:value).to_f.round(2) %></p>