app/views/designs/index.html.erb

        <div class="card">
          <% if design.design_url.present? %>
---
SELECT designs.*, SUM(likes.value) AS total_likes FROM `designs` INNER JOIN `likes` ON `likes`.`design_id` = `designs`.`id` GROUP BY `designs`.`id` ORDER BY SUM(likes.value) ASC

              <%= link_to "Create Booking", new_booking_path(design_id: design.id), class: "editdes" %>
            <% elsif current_architect.present? && design.architect == current_architect %>
---
SELECT `architects`.* FROM `architects` WHERE `architects`.`id` = 1 ORDER BY `architects`.`id` ASC LIMIT 1