app/views/designs/show.html.erb

SELECT `likes`.* FROM `likes` WHERE `likes`.`design_id` = 2
SELECT COUNT(*) FROM `likes` WHERE `likes`.`design_id` = 1
---
  <div>
    <p><%= @design.likes.count %> <%= (@design.likes.count) == 1 ? 'Like' : 'Likes' %></p>

SELECT `ratings`.* FROM `ratings` WHERE `ratings`.`user_id` = 4 AND `ratings`.`design_id` = 3 LIMIT 1
SELECT 1 AS one FROM `ratings` WHERE `ratings`.`design_id` = 1 AND `ratings`.`user_id` = 1 LIMIT 1
SELECT `ratings`.* FROM `ratings` WHERE `ratings`.`user_id` = 1 AND `ratings`.`design_id` = 1 LIMIT 1
---
    <% if current_user.present? %>
      <% if @design.ratings.exists?(user_id: current_user.id) %>
        <!-- Edit Rating form -->
        <%= form_with(model: [@design, current_user.ratings.find_by(design_id: @design.id)], url: design_rating_path(@design, @design.ratings.first), method: :patch) do |form| %>

SELECT `ratings`.* FROM `ratings` WHERE `ratings`.`user_id` = 1 AND `ratings`.`design_id` = 1 LIMIT 1
---
        <!-- Delete Rating button -->
        <%= button_to 'Delete Rating', design_rating_path(@design, current_user.ratings.find_by(design_id: @design.id)), method: :delete, data: { confirm: 'Are you sure?' } %>

SELECT `ratings`.* FROM `ratings` WHERE `ratings`.`design_id` = 1
SELECT AVG(`ratings`.`value`) FROM `ratings` WHERE `ratings`.`design_id` = 1
---
    <% else %>
      <% if @design.ratings && @design.ratings.present? %>
        <p>Average Rating: <%= @design.ratings.average(:value).to_f.round(2) %></p>

SELECT `comments`.* FROM `comments` WHERE `comments`.`design_id` = 1
---

      <% @design.comments.each do |comment| %>

SELECT `comments`.* FROM `comments` WHERE `comments`.`design_id` = 1
---
    <% else %>
      <% @design.comments.each do |comment| %>

SELECT `likes`.* FROM `likes` WHERE `likes`.`design_id` = 1 AND `likes`.`user_id` = 1 LIMIT 1
SELECT 1 AS one FROM `likes` WHERE `likes`.`design_id` = 1 AND `likes`.`user_id` = 1 LIMIT 1
---
    <% if current_user.present? %>
      <% if @design.likes.exists?(user: current_user) %>
        <%= button_to 'Unlike', design_like_path(@design, @design.likes.find_by(user: current_user)), method: :delete %>

SELECT `architects`.* FROM `architects` WHERE `architects`.`id` = 1 LIMIT 1
---

    <% if current_architect.present? && @design.architect == current_architect %>