app/views/designs/show.html.erb


<% if @design.likes.exists?(user: current_user) %>
  <%= button_to 'Unlike', design_like_path(@design, @design.likes.find_by(user: current_user)), method: :delete %>
---
SELECT `likes`.* FROM `likes` WHERE `likes`.`design_id` = 1 AND `likes`.`user_id` = 1 LIMIT 1
SELECT 1 AS one FROM `likes` WHERE `likes`.`design_id` = 2 AND `likes`.`user_id` = 2 LIMIT 1
SELECT `likes`.* FROM `likes` WHERE `likes`.`design_id` = 3 AND `likes`.`user_id` = 2 LIMIT 1