app/views/designs/show.html.erb

            <!-- like button -->
          <% if @design.likes.exists?(user: current_user) %>
---
SELECT `likes`.* FROM `likes` WHERE `likes`.`design_id` = 1 AND `likes`.`user_id` = 1 LIMIT 1
SELECT 1 AS one FROM `likes` WHERE `likes`.`design_id` = 1 AND `likes`.`user_id` = 1 LIMIT 1

              <div class="comment">
                <% if comment.user.present? %>
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 ORDER BY `users`.`id` ASC LIMIT 1