app/views/bookings/index.html.erb

SELECT `architects`.* FROM `architects` WHERE `architects`.`id` = 260 ORDER BY `architects`.`id` ASC LIMIT 1
---

            <% if booking.design.present? && booking.design.architect.present? %>

SELECT `users`.* FROM `users` WHERE `users`.`id` = 71 ORDER BY `users`.`id` ASC LIMIT 1
---

          <% if booking.user.present? %>