app/controllers/bookings_controller.rb

  def new
    @design = Design.find_by(id: params[:design_id])
---
SELECT `designs`.* FROM `designs` WHERE `designs`.`id` = 36 LIMIT 1