app/controllers/comments_controller.rb

INSERT INTO `comments` (`content`, `user_id`, `design_id`, `created_at`, `updated_at`) VALUES ('this is nice design', 1, 1, '2024-01-18 03:43:28.641803', '2024-01-18 03:43:28.641803')
---
  def create
    @comment = @design.comments.build(comment_params)
    @comment.user = current_user

    if @comment.save

UPDATE `comments` SET `comments`.`content` = 'hi very nice', `comments`.`updated_at` = '2024-01-18 04:08:34.275057' WHERE `comments`.`id` = 4
---
  def update
    authorize_comment_owner!

    if @comment.update(comment_params)

DELETE FROM `comments` WHERE `comments`.`id` = 2
---
  def destroy
    authorize_comment_owner!
    @comment.destroy

SELECT `designs`.* FROM `designs` WHERE `designs`.`id` = 1 LIMIT 1
---
  def set_design
    @design = Design.find_by(id: params[:design_id])

SELECT `comments`.* FROM `comments` WHERE `comments`.`id` = 1 LIMIT 1
---
  def set_comment
    @comment = Comment.find_by(id: params[:id])