app/controllers/designs_controller.rb

SELECT COUNT(*) AS `count_all`, `designs`.`id` AS `designs_id` FROM `designs` LEFT OUTER JOIN `likes` ON `likes`.`design_id` = `designs`.`id` WHERE `designs`.`architect_id` = 1 GROUP BY `designs`.`id` ORDER BY COUNT(likes.id) DESC
SELECT COUNT(*) AS `count_all`, `designs`.`id` AS `designs_id` FROM `designs` LEFT OUTER JOIN `likes` ON `likes`.`design_id` = `designs`.`id` WHERE `designs`.`architect_id` = 1 GROUP BY `designs`.`id` ORDER BY COUNT(likes.id) ASC
---
  def index
    if current_architect.present?
      if params[:design_name].present?
        @pagy, @designs = pagy(current_architect.designs.where("design_name LIKE ?", "%#{params[:design_name]}%"), items: 2)
      elsif params[:category].present?
        @pagy, @designs = pagy(current_architect.designs.where("category LIKE ?", "%#{params[:category]}%"), items: 2)
      elsif params[:sort] == 'likes'
        @pagy, @designs = pagy(current_architect.designs.left_joins(:likes).group(:id).order('COUNT(likes.id) DESC'), items: 2)
      elsif params[:sort] == 'dislikes'
        @pagy, @designs = pagy(current_architect.designs.left_joins(:likes).group(:id).order('COUNT(likes.id) ASC'), items: 2)

SELECT `designs`.* FROM `designs` WHERE `designs`.`id` = 6 LIMIT 1
---
  def show
    @design = Design.find(params[:id])

INSERT INTO `designs` (`design_name`, `style`, `price_per_sqft`, `square_feet`, `category`, `floorplan`, `time_required`, `bio`, `brief`, `architect_id`, `created_at`, `updated_at`) VALUES ('classic traditional design', 'interior style', 12, 1750, 'bedroom', '2bhk', '2', 'When it comes to interior design styles, almost everything is rooted in traditional interior design ideas', 'When it comes to interior design styles, almost everything is rooted in traditional interior design ideas', 2, '2024-01-18 09:43:46.689109', '2024-01-18 09:43:46.689109')
---
  def create
    @design = current_architect.designs.new(design_params)
    if @design.save

UPDATE `designs` SET `designs`.`style` = 'Minimalis', `designs`.`updated_at` = '2024-01-18 09:55:05.291720' WHERE `designs`.`id` = 6
---
  def update
    if @design.architect == current_architect
      if @design.update(design_params)

DELETE FROM `designs` WHERE `designs`.`id` = 6
---
  def destroy
    if @design.architect == current_architect
      @design.destroy

SELECT `designs`.* FROM `designs` WHERE `designs`.`id` = 6 LIMIT 1
---
  def set_design
    @design = Design.find(params[:id])