app/controllers/designs_controller.rb

  def index
    if params[:design_name].present?
      @pagy, @designs = pagy(Design.where("design_name LIKE ?", "%#{params[:design_name]}%"),  items: 2)
    elsif params[:category].present?
      @pagy, @designs = pagy(Design.where("category LIKE ?", "%#{params[:category]}%"),  items: 2)
    elsif params[:sort] == 'likes'
      @pagy, @designs = pagy(Design.left_joins(:likes).group(:id).order('COUNT(likes.id) DESC'), items: 2)
    elsif params[:sort] == 'dislikes'
      @pagy, @designs = pagy(Design.left_joins(:likes).group(:id).order('COUNT(likes.id) ASC'), items: 2)
    else
      @pagy, @designs = pagy(Design.all ,  items: 2)
---
SELECT `designs`.* FROM `designs` WHERE `designs`.`design_name` = 'Minimalist'
SELECT designs.*, SUM(likes.value) AS total_likes FROM `designs` INNER JOIN `likes` ON `likes`.`design_id` = `designs`.`id` GROUP BY `designs`.`id` ORDER BY SUM(likes.value) ASC
SELECT COUNT(*) AS `count_all`, `designs`.`id` AS `designs_id` FROM `designs` LEFT OUTER JOIN `likes` ON `likes`.`design_id` = `designs`.`id` GROUP BY `designs`.`id` ORDER BY COUNT(likes.id) DESC
SELECT COUNT(*) AS `count_all`, `designs`.`id` AS `designs_id` FROM `designs` LEFT OUTER JOIN `likes` ON `likes`.`design_id` = `designs`.`id` GROUP BY `designs`.`id` ORDER BY COUNT(likes.id) ASC
SELECT `likes`.* FROM `likes` WHERE `likes`.`design_id` = 2
SELECT `designs`.* FROM `designs`

  def create
    @design = Design.new(design_params)
    if @design.save
---
INSERT INTO `designs` (`design_name`, `style`, `price_per_sqft`, `square_feet`, `category`, `floorplan`, `time_required`, `bio`, `brief`, `architect_id`, `created_at`, `updated_at`) VALUES ('classic traditional design', 'Traditional', 12, 1234, 'livingroom', '2bhk', '2', 'When it comes to interior design styles, almost everything is rooted in traditional interior design ideas', 'When it comes to interior design styles, almost everything is rooted in traditional interior design ideas', 1, '2024-01-18 01:05:18.040083', '2024-01-18 01:05:18.040083')

  def update
    if @design.update(design_params)
---
UPDATE `designs` SET `designs`.`design_name` = 'Mid-century modern interior Design', `designs`.`style` = 'modern interior design', `designs`.`bio` = 'A modern interior design style is defined by clean and simple color schemes, welcoming feel, clean individual elements, ', `designs`.`brief` = 'A modern interior design style is defined by clean and simple color schemes, welcoming feel, clean individual elements, ', `designs`.`updated_at` = '2024-01-11 03:57:39.821592' WHERE `designs`.`id` = 2

  def destroy
    @design.destroy
---
DELETE FROM `designs` WHERE `designs`.`id` = 1

  def set_design
    @design = Design.find(params[:id])
---
SELECT `designs`.* FROM `designs` WHERE `designs`.`id` = 1 LIMIT 1