app/controllers/likes_controller.rb

INSERT INTO `likes` (`design_id`, `user_id`, `created_at`, `updated_at`) VALUES (3, 1, '2024-01-12 16:45:36.098807', '2024-01-12 16:45:36.098807')
---
    def create
      if already_liked?
        flash[:notice] = "You can't like more than once"
      else
        @design.likes.create(user_id: current_user.id)

DELETE FROM `likes` WHERE `likes`.`id` = 1
---
    def destroy
      @like.destroy

SELECT `designs`.* FROM `designs` WHERE `designs`.`id` = 2 LIMIT 1
---
    def find_design
      @design = Design.find(params[:design_id])

SELECT `likes`.* FROM `likes` WHERE `likes`.`design_id` = 2 AND `likes`.`id` = 1 LIMIT 1
---
    def find_like
      @like = @design.likes.find(params[:id])

SELECT 1 AS one FROM `likes` WHERE `likes`.`user_id` = 1 AND `likes`.`design_id` = 2 LIMIT 1
SELECT `likes`.* FROM `likes` WHERE `likes`.`design_id` = 2 AND `likes`.`id` = 1 LIMIT 1
---
    def already_liked?
      Like.where(user_id: current_user.id, design_id: @design.id).exists?