app/controllers/ratings_controller.rb

  def create
    @design = Design.find(params[:design_id])
    existing_rating = @design.ratings.find_by(user: current_user)

    if existing_rating
      redirect_to @design, alert: 'You have already rated this design.'
    else
      @rating = @design.ratings.new(rating_params)
      @rating.user = current_user

      if @rating.save
---
SELECT `designs`.* FROM `designs` WHERE `designs`.`id` = 2 LIMIT 1
SELECT `ratings`.* FROM `ratings` WHERE `ratings`.`design_id` = 5 AND `ratings`.`user_id` = 2 LIMIT 1
INSERT INTO `ratings` (`value`, `design_id`, `user_id`, `created_at`, `updated_at`) VALUES (3, 4, 2, '2024-01-13 11:16:41.800670', '2024-01-13 11:16:41.800670')

  def update
    @design = Design.find(params[:design_id])
    @rating = @design.ratings.find_by(user: current_user)

    if @rating.nil?
      redirect_to @design, alert: 'Rating not found.'
    elsif @rating.update(rating_params)
---
SELECT `designs`.* FROM `designs` WHERE `designs`.`id` = 2 LIMIT 1
SELECT `ratings`.* FROM `ratings` WHERE `ratings`.`design_id` = 2 AND `ratings`.`user_id` = 4 LIMIT 1
UPDATE `ratings` SET `ratings`.`value` = 4, `ratings`.`updated_at` = '2024-01-17 07:24:23.572417' WHERE `ratings`.`id` = 9

  def destroy
    @design = Design.find(params[:design_id])
    @rating = @design.ratings.find_by(user: current_user)

    if @rating.nil?
      redirect_to @design, alert: 'Rating not found.'
    else
      @rating.destroy
---
SELECT `designs`.* FROM `designs` WHERE `designs`.`id` = 3 LIMIT 1
SELECT `ratings`.* FROM `ratings` WHERE `ratings`.`design_id` = 3 AND `ratings`.`user_id` = 4 LIMIT 1
DELETE FROM `ratings` WHERE `ratings`.`id` = 9